Tekla Open API Reference for Tekla Structures 2025
UnsupportedChamferException Constructor
 Initializes a new instance of the UnsupportedChamferException class with "Plates containing unsupported chamfer information" error message.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UnsupportedChamferException()
Public Sub New
See Also
Reference
UnsupportedChamferException Class
Tekla.Structures.Model Namespace